# IsSingleCurve Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalElement..::..IsSingleCurve Method
AnalyticalElement Class See Also
---
Indicates if the Analytical Element can be expressed as a single curve.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsSingleCurve()
```

Visual Basic
---
```text
Public Function IsSingleCurve As Boolean
```

Visual C++
---
```text
public:
bool IsSingleCurve()
```

# ### Return Value
True if Analytical Element can be expressed as a single curve, false otherwise.
# See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace